{"A": [{"dreamName": "Abnormal", "dreamText": "To dream of something abnormal, such as a horse with feathers or an airplane flying backwards, means you will shortly have a pleasing solution for your worries."}, {"dreamName": "Abroad", "dreamText": "A dream of going abroad by ship means you will make an influential new friend in the near future. Being abroad, in foreign places, indicates an unsettled condition and a probable change of location."}, {"dreamName": "Abyss", "dreamText": "This is an obstacle dream. If you avoid the fall, you will overcome your difficulties, but if you fall into the abyss, it is a warning that you must be extremely careful in your business dealings."}, {"dreamName": "Accelerator", "dreamText": "Using it to increase the speed of a car (or any other vehicle) indicates that you will achieve your objectives through your own efforts. If the accelerator is jammed or you were unable to control it, this is a warning to beware of a habit which could turn into a vice if you're not careful."}, {"dreamName": "Accident", "dreamText": "The meaning of an accident varies greatly, depending on the circumstances and surroundings, but it's usually a warning. If you dreamed of an accident, you would be wise to avoid unnecessary travel for a few weeks. An accident at sea pertains to love affairs; on land, to business dealings. If possible, you should avoid the thing that was involved in the accident for 24 hours after the dream, e.g. if you dreamed of a car crash, walk for a day, but be careful crossing streets! Steer clear of planes, trains, horses, knives, sharp instruments, fires, electricity, high places, or whatever the accident involved for at least a day, and if you can't avoid it, take extra precautions."}, {"dreamName": "Acid", "dreamText": "Be cautious in regard to promises given or reliance on promises received."}, {"dreamName": "Acorn", "dreamText": "You are immensely lucky if you dreamed of anything to do with acorns or the oak tree which bears them. They predict the successful outcome of any problems you may have now and foretell prosperity and good fortune in your future plans."}, {"dreamName": "Adder", "dreamText": "This poisonous snake warns you against false friends and/or a loss of prestige through deceit. If you killed an adder, you will triumph over an enemy."}, {"dreamName": "Adrift", "dreamText": "This is indicative of a problem you have been unable to solve or unwilling to face up to, and is a straightforward obstacle dream. If you reached land safely, you will overcome your dilemma, but if you fell out of the boat or were upset by rough weather, it is a warning of serious difficulty due to indecision. If you were rescued or managed to swim to safety, success will follow hardship."}, {"dreamName": "Adultery", "dreamText": "If you committed it, be on guard against giving your confidence to new friends; if you resisted it, you will have some disappointing setbacks, but they will be temporary."}, {"dreamName": "Advice", "dreamText": "Beware of humiliating quarrels with friends if you gave advice in your dream, but if you received advice you will make some new and useful friends."}, {"dreamName": "Affliction", "dreamText": "The greater the affliction, the more certain your success in life will be."}, {"dreamName": "Afraid", "dreamText": "You will recognize your difficulties and find the courage to overcome them."}, {"dreamName": "Age", "dreamText": "To worry about your age or to dream you have aged beyond your actual years indicates you should see a doctor. To dream about old people is an omen of great good luck. If they are poor or ragged, you may have some difficulties ahead, but you can easily overcome these by positive, bold action."}, {"dreamName": "Agnostic", "dreamText": "Religious disbelief is a reminder to be more cautious in your associations with the opposite sex."}, {"dreamName": "Agony", "dreamText": "Whether it involved yourself or others, the greater the agony, the greater your coming joy will be."}, {"dreamName": "Alien", "dreamText": "You will make valuable new friends. If your dream involved dealing or meeting with aliens, important changes are coming your way."}, {"dreamName": "Alligator", "dreamText": "This dream is trying to alert you to an enemy. Be very cautious in any new venture."}, {"dreamName": "Altar", "dreamText": "You will have a sudden release from pressing worries and/or good news from an unexpected source."}, {"dreamName": "Ambulance", "dreamText": "No broad interpretation can be given, as this dream varies greatly according to its details, but it is generally a warning against indiscretion in relations with the opposite sex. However, a full ambulance signifies the fulfillment of your hopes in a shorter time than you thought possible."}, {"dreamName": "Amorous", "dreamText": "To feel amorous suggests a friendship which will ripen into an exciting romance, but if you dreamed of an amorous person of the opposite sex, you should guard against a relationship which might involve you in a serious embarrassment, if not an actual scandal."}, {"dreamName": "Amputation", "dreamText": "If the loss was to someone else, be prepared for some unexpected difficulties ahead; but if you dreamed of the loss of one of your own limbs, you can look forward to an unanticipated important gain."}, {"dreamName": "Angel", "dreamText": "This forecasts success, protection, happiness, and rewarding friendships."}, {"dreamName": "Animals", "dreamText": "To see wild animals is generally a good omen pertaining to business, but the interpretation depends on their attitude: if they were calm, your affairs will prosper, but if they attacked you (or each other), you can expect some reverses."}, {"dreamName": "Ants", "dreamText": "If you observed the interesting organized activity of these industrious creatures, a change of business or position may ensue, but if they were on food or on clothing, as pests, you will have a spell of frustration and hard work before achieving independence."}, {"dreamName": "Appetite", "dreamText": "If you were aware of hunger or your appetite was small, a medical checkup is suggested. A large appetite may indicate money concerns and is a warning to handle money with respect or your finances could become chaotic."}, {"dreamName": "Applause", "dreamText": "There is some ill-feeling and/or jealousy around you, but you can overcome it if you try a bit of tact."}, {"dreamName": "Apples", "dreamText": "This popular fruit is generally a good omen, but the interpretation depends greatly on details. If the apples were ripe and sweet (or cooked and sweet), they are a promise of well-earned rewards. If they were green or bitter, you are in danger of loss through your own foolishness."}, {"dreamName": "Arch", "dreamText": "Your efforts are in the right direction if the arch was whole and/or attractive, but if it appeared to be broken or damaged in any way, a new line of endeavor is suggested."}, {"dreamName": "Arrest", "dreamText": "You'll have sharp disappointment followed closely by an unexpected joy."}, {"dreamName": "Arson", "dreamText": "An offer of a change for the better will soon come your way."}, {"dreamName": "Artery", "dreamText": "If your arteries were weak or cut, you will be enjoying honor among your friends."}, {"dreamName": "Assault", "dreamText": "If you were assaulted, you will be given some information which will be of great value; if others were assaulted, you may have to defend an attack upon your character."}, {"dreamName": "Audience", "dreamText": "A surprising distinction will come your way if you faced an audience; if you were in it, you will have cause to rejoice over the good fortune of a valued friend."}, {"dreamName": "Autograph", "dreamText": "Collecting them signifies a quick profit; signing them is a forecast of eventual success in your chosen endeavors."}, {"dreamName": "Automobile", "dreamText": "The meaning of a dream involving a motorcar depends very much on its aspect. If the car was merely a means of transport, it has, in itself, no particular significance, and other details of the dream should be carefully considered. However, if the car was speeding, you can expect some sudden news from a distance; an accident forecasts recovery of something lost; if the engine lost power or stalled or if you ran out of gas, you could be embarrassed by misplacing your confidence and/or affections."}, {"dreamName": "Avalanche", "dreamText": "To observe one predicts some rather formidable obstacles in your path; a change of plan would be advisable. If you were buried in an avalanche, you will have a spectacular stroke of good luck, but if you dreamed of others being buried, the forecast is of a change of surroundings."}, {"dreamName": "Axe", "dreamText": "If the axe was bright and keen, it signifies gratifying rewards for work well done; if it was dull, it indicates a loss of prestige which could be averted by closer attention to your own business."}], "B": [{"dreamName": "Baby", "dreamText": "If the baby was cute, you will be fortunate through the help of friends. However, if the baby was ugly or in any way displeasing to you, look out for treachery in someone you are inclined to trust. Helpless or sick babies are generally a warning of difficulties ahead, so be cautious in your business and/or love affairs. A walking baby indicates sudden independence, and if you dreamed of many babies, great satisfaction and happiness are coming your way."}, {"dreamName": "Bacon", "dreamText": "Eating bacon means continuing prosperity in your life. Rancid bacon is a suggestion to see a doctor. Cooking bacon augurs a surprise, or gift, which will please you very much."}, {"dreamName": "Bake", "dreamText": "If you dreamed of baking anything yourself, you may confidently look forward to a rise in status. If the dream concerned a bakery or professional bakers, your year ahead will be prosperous."}, {"dreamName": "Bald", "dreamText": "You need to be on guard against being cheated by someone you trust if you dreamed of baldness in others. Your own baldness is a health warning; get a medical checkup."}, {"dreamName": "Balloon", "dreamText": "Toy balloons signify trivial disappointments; however, passenger balloons follow the expected interpretation—ascending is favorable, while descending portends setbacks."}, {"dreamName": "Bandage", "dreamText": "Good new influences are moving in around you."}, {"dreamName": "Bar", "dreamText": "You will be tempted to stoop to some questionable actions if you dreamed of tending a bar. If you were drinking or merely observing the activity in a bar, it is a suggestion to interest yourself in community affairs."}, {"dreamName": "Bat", "dreamText": "The meaning of this augury is dependent on how you reacted to the bat. If you were frightened by it, you should avoid indiscreet discussion of your affairs, but if you were not afraid of it, you will be offered a new proposition which will be profitable."}, {"dreamName": "Beach", "dreamText": "The interpretation varies greatly according to the dream's details. You will likely need financial help if it involved working on a beach. Lying on a beach indicates that you'll soon be almost too busy with a new venture."}, {"dreamName": "Beating", "dreamText": "If you were beating or being beaten by friends or loved ones, it is a fortunate omen for personal or family affairs; however, if strangers were involved, it is a warning to not procrastinate in dealing with current domestic problems. If it concerned the beating of animals or carpets, it indicates difficulties arising from lack of organization which are within your power to overcome if you concentrate."}, {"dreamName": "Bed", "dreamText": "A strange bed forecasts an upturn in business affairs; your own bed promises security; making a bed suggests that you should expect some unexpected visitors."}, {"dreamName": "Beer", "dreamText": "Pouring or drinking beer is a good omen, especially if there was foam on it. But if the beer was flat or stale or others drank it, you are being warned not to be persuaded to enter into some unworthy intrigue which could backfire and damage your reputation."}, {"dreamName": "Bees", "dreamText": "These busy creatures are forerunners of great good fortune in business matters, even if they stung you. However, if they were dead, listless, or you killed them, you could suffer a loss by putting too much trust in \"friends.\" If you heard the bees buzzing, expect good news."}, {"dreamName": "Beetles", "dreamText": "A warning of hostility and jealousy among your associates. If you killed the insects or managed to get rid of them, your difficulties will be temporary."}, {"dreamName": "Beggar", "dreamText": "You will receive unexpected help if you dreamed of begging or of giving to a beggar. If you refused, you will be disappointed by someone on whom you counted."}, {"dreamName": "Behead", "dreamText": "Your success is assured if you dreamed of being beheaded; if the beheading involved others, success is still predicted, but only after discouraging delays."}, {"dreamName": "Bell", "dreamText": "You will receive disappointing news if you heard a single bell ringing, but if you heard many bells, the news will be joyous. Church bells could be a warning against problems arising from people pulling against you."}, {"dreamName": "Bereavement", "dreamText": "News of a birth, engagement, or wedding is likely to follow."}, {"dreamName": "Bicycle", "dreamText": "A bicycle represents assistance in your endeavors, so to interpret the meaning of your dream, you must consider whether you were riding it, pushing it, going uphill or down, and the appearance and/or condition of the bike, as well as details of the location, weather, etc."}, {"dreamName": "Birds", "dreamText": "Birds are generally considered a fortunate omen, especially if they are brightly colored, singing, and/or flying. Dead or injured birds are an indication of coming worries unless they are birds of prey, in which case the worries will be short-lived. Birds' eggs in a nest signify money, while broken eggs forecast disappointment, and hatching eggs indicate delayed profits. An empty nest is a warning not to be drawn into family arguments. To be aware in your dream of the beak of a bird is a forecast of a change of residence, whether for better or worse, depending on the other details of the dream."}, {"dreamName": "Blackmail", "dreamText": "You are being warned against indiscreet behavior with the opposite sex if someone tried to blackmail you. If you were the blackmailer, you would be wise to avoid any type of gambling for the time being."}, {"dreamName": "Blind", "dreamText": "Whether it involved others who were blind or your own blindness, this is a straightforward sign of deceit among those you trust most."}, {"dreamName": "Blood", "dreamText": "Be prepared for a period of hard work against hostile forces if you saw blood. If you were bleeding, try to avoid any sort of controversy with friends or relatives; however, if the blood was involved in a transfusion, you can expect your difficulties to be very transitory."}, {"dreamName": "Blush", "dreamText": "Blushing predicts that you will discover a false friend; to observe blushes in others is a warning against repeating gossip."}, {"dreamName": "Bones", "dreamText": "Meat bones signify business reverses; human bones indicate a coming inheritance; fish bones suggest getting a medical checkup."}, {"dreamName": "Bouquet", "dreamText": "A fresh bright bouquet signifies a happy social occasion. If it was wilted, a medical checkup is indicated."}, {"dreamName": "Brothel", "dreamText": "For either a man or a woman, a dream of visiting such an establishment signifies an improvement in domestic affairs."}, {"dreamName": "Bullet", "dreamText": "Don't expose yourself to any possible scandal if your dream featured the sight or sound of a bullet; if you were hit by a bullet, you'd better have a medical checkup."}, {"dreamName": "Burial", "dreamText": "You will no doubt have news of a marriage, be invited to a wedding, or hear of a birth soon. However, if your dream was one of being buried alive, it is telling you to avoid doing anything which you know or suspect to be even marginally unethical."}, {"dreamName": "Burning", "dreamText": "Fire signifies a coming increase in prosperity, unless it was a very large building that was burning, in which case you are being warned to guard your finances."}, {"dreamName": "Bus", "dreamText": "Traveling by bus indicates progress toward your heart's desire; waiting for a bus signifies setbacks which will be very temporary. A bus accident predicts a period of frustration due to financial embarrassment."}], "C": [{"dreamName": "Captive", "dreamText": "A dream featuring captivity suggests tension and over-strain, probably due to overspending and a warning to cut all extravagances, unless the captives were animal, in which case you should soon be finding life most enjoyable."}, {"dreamName": "Car", "dreamText": "You can forget about great luxury, but modest comfort will surely be yours if your dream featured a railroad or cable car. See also Automobile."}, {"dreamName": "Castration", "dreamText": "Whether the castration was your own, someone else's, or involved animals, it augurs eventual triumph over all obstacles and opposition to your aims."}, {"dreamName": "Cat", "dreamText": "A generally unfortunate omen indicating treachery and deceit among those you trust. If you killed the cat, you will defeat the purpose of your detractors; if you chased it away, you may expect a sudden stroke of luck."}, {"dreamName": "Cave", "dreamText": "An obstacle dream. If you found your way out, you can expect eventually to overcome your difficulties, but if you failed to get out, you must prepare for an escalation of your worries for a rather long period. Dreams involving cave dwellers are omens of marital happiness."}, {"dreamName": "Cell", "dreamText": "You are being warned against carelessness with your commitments if you dreamed of being confined in a cell. Failure to keep your promises could lead to a loss of valued friends."}, {"dreamName": "Cemetery", "dreamText": "If the cemetery was well kept, it signifies coming happiness and prosperity; however, if the general appearance of the place was dreary, you must expect a bit of trouble first."}, {"dreamName": "Chase", "dreamText": "No luxury, but a comfortable old age through your own efforts is forecast in a dream where you participated in, or observed, a chase."}, {"dreamName": "Cheat", "dreamText": "If you were being cheated, you can expect a stroke of luck; however, if you were the cheater, you can expect to be cheated."}, {"dreamName": "Cheese", "dreamText": "The significance of cheese varies greatly according to other details. As a general rule, eating cheese signifies success in love. Smelly cheeses such as Limburger predict financial and/or social embarrassment, but mild or processed cheese signifies a need for change. If you were making cheese, your current ventures will be successful beyond your expectations. Dry and/or grated cheese signifies a stroke of money luck."}, {"dreamName": "Chess", "dreamText": "This ancient game is an omen of annoying obstacles in your path. You can expect a strenuous business period ahead, but don't despair; you can win if you persevere and vary your tactics by using a little imagination."}, {"dreamName": "Chocolate", "dreamText": "Oddly, a dream featuring chocolate drinks, candy, or anything of this flavor does not, as one might expect, indicate luxury, but it does predict good health and modest contentment."}, {"dreamName": "Circus", "dreamText": "If your dream involved being with children at a circus or taking them to one, it is a sign of exceptional luck in financial matters; otherwise, it is a warning to be more careful of the impression you make on others."}, {"dreamName": "Cliffs", "dreamText": "An obstacle dream of warning: Avoid any risks for the next few months unless you were successfully scaling the cliff, in which case the augury is reversed and indicates satisfactory rewards for your efforts."}, {"dreamName": "Cobwebs", "dreamText": "You'll be lucky if you dreamed of cobwebs in a place like a wine cellar or attic, but if they were where they shouldn't be—for example on clothes, furniture, or books—they predict difficulties through secretly hostile competition; however, if you brushed them away, you will easily overcome the difficulties."}, {"dreamName": "Colors.", "dreamText": "ou can expect increasing success and security if you dream of a mixture of bright colours. If one colour stood out in your dream the significance is as follows:"}], "D": [{"dreamName": "Dagger", "dreamText": "If you saw a dagger, you can expect news from a distance. To carry a dagger is a warning to be more circumspect in your actions or you might become involved in an unpleasant situation; to see others with daggers or someone stabbed by one signifies triumph over hostility."}, {"dreamName": "Danger", "dreamText": "You will overcome your difficulties if you faced the danger. If the danger was of a physical nature and you avoided it, it is a warning to look after your health."}, {"dreamName": "Darkness", "dreamText": "Be prepared for a setback; however, if you managed to grope your way to the light, you will achieve great success. If you were walking in the dark, you will recover something you had given up for lost."}, {"dreamName": "Death", "dreamText": "If you dreamed of being dead yourself, it indicates an approaching release from all your worries and/or a recovery from illness. If you spoke with someone who is dead, you will soon hear very good news. To dream of a death frequently signifies news of a birth. To be aware of a dead person you cannot identify portends an inheritance which may not be personal but could be indirectly beneficial."}, {"dreamName": "Defend", "dreamText": "If your dream involved shielding or defending someone else, you can be sure your trust is well placed. If you defended yourself or someone else defended you, you should avoid forcing any important issues for the time being, as someone you count on for support could suddenly fail you."}, {"dreamName": "Desert", "dreamText": "In bloom, and/or in clear sunny weather, a dream featuring a desert predicts contentment and good success in your efforts; but if the weather was bad or if there was a sandstorm, you can expect some immediate difficulties due to hidden opposition, but the outcome will be better than you expect."}, {"dreamName": "Despair", "dreamText": "You'll have no cause to if you dreamed about it; everything will come up roses before long."}, {"dreamName": "Diamonds", "dreamText": "Strangely enough, these glittering symbols of affluence are not particularly fortunate omens. If, in your dream, you own them or are in a position to have them, they signify losses though not of a serious order. On the other hand, if your financial position doesn't allow for diamonds, their appearance indicates coming profits, although perhaps not as large as you might be expecting."}, {"dreamName": "Disaster", "dreamText": "To dream of being in or witnessing a disaster is a forerunner of improved circumstances."}, {"dreamName": "Discover", "dreamText": "It's a happy omen if you suddenly discovered someone or something in your dream; you should soon come into an inheritance. If you were the one discovered, it's a promise of seeing new faces in new places, so get ready to travel."}, {"dreamName": "Distress", "dreamText": "You'll make a gain where you expected to take a loss if you dreamed of yourself or others being in distress."}, {"dreamName": "Doctor", "dreamText": "It's a good man or woman to have in your dream because a doctor forecasts an improvement in all departments of your life."}, {"dreamName": "Dolphin", "dreamText": "These amusing, intelligent mammals are a sign of advancement through your own mental vigor, but other details of your dream should also be considered, such as the conditions of the water, the location, and/or action of the dolphin."}, {"dreamName": "Dragon", "dreamText": "You will get an enormous boost in your progress toward financial success from a powerful and influential personage. And if you don't know such a big wheel, you soon will."}, {"dreamName": "Dreams", "dreamText": "A dream within a dream portends a deferment of your highest hopes but nevertheless a definite improvement in your present circumstances."}, {"dreamName": "Drown", "dreamText": "An unfortunate omen pertaining to business interests, unless you (or the drowning person) was revived or rescued, in which case you will get a chance to recoup your losses through the intervention of a friend."}, {"dreamName": "Drums", "dreamText": "To hear drums forecasts great success and to play them yourself signifies great joy."}, {"dreamName": "Dungeon", "dreamText": "An obstacle dream. If you couldn't get out, you would probably benefit from a change of plans, but if you managed to escape, you can expect to achieve your aims in time, but only with diligent effort."}], "E": [{"dreamName": "Eagle", "dreamText": "If you see an eagle flying, your business prospects are very rosy indeed. And should this noble bird happen to be perched in a high place, you will have fame as well as fortune. If you see it on a mountaintop, you will achieve beyond your highest ambitions. However, should the eagle attack or frighten you, you will have to overcome some difficult obstacles before reaching your goal."}, {"dreamName": "Earthquake", "dreamText": "This is a rare dream and its meaning varies greatly. For those who live in an earthquake area, it may merely indicates some minor difficulties to be overcome. But for others it signifies a complete change of circumstances and/or environment from which they can eventually reap a rich reward, but only through diligence and perseverance."}, {"dreamName": "Eating", "dreamText": "The interpretation of this action differs greatly according to the circumstances and other factors involved, so you must consider the various foods, fruits, vegetables, and/or meat. However, as a general rule, eating with guests is a happy omen, but to eat alone is a warning to guard against a loss of status or valued friends."}, {"dreamName": "Echo", "dreamText": "If the echo was of your own voice, you can expect to have a strange experience, probably with the opposite sex. If the echo is near, you will hear good news concerning others; if far away, the news will be from a distance."}, {"dreamName": "Elf", "dreamText": "Help from unexpected, or even unknown, sources will be yours if you dreamed of these mystical, magical creatures."}, {"dreamName": "Emigration", "dreamText": "Tighten your belt and prepare to economize because you'll have some unexpected demands on your resources if your dream featured emigrants or emigration."}, {"dreamName": "Enemy", "dreamText": "You can rely on having loyal and helpful friends if you dreamed of someone you knew, or suspected, was an enemy."}, {"dreamName": "Engraving", "dreamText": "You are in for a season of all-round improvement if your dream featured engraving or engraved articles."}, {"dreamName": "Entrails", "dreamText": "A definite warning to slow down. Try to avoid any situations which cause you undue anxiety for the time being and get a medical checkup as soon as you can."}, {"dreamName": "Eruption", "dreamText": "The eruption of a volcano or other natural phenomena such as a geyser forecasts a sudden change for the better."}, {"dreamName": "Escalator", "dreamText": "This dream symbol follows the general rule that up is an omen of success and down is not; however, in this particular instance, the downward motion indicates a defeat which could be reversible by the application of intelligent determination."}, {"dreamName": "Evil", "dreamText": "An evil atmosphere or spirit predicts unaccountable obstacles to your current ambitions; you would do well to consider a change of direction and/or objectives."}, {"dreamName": "Exile", "dreamText": "Being banished from your own country is a warning to guard against hasty speech and/or impulsive actions which, if misinterpreted, could make you the subject of damaging gossip."}, {"dreamName": "Explosion", "dreamText": "The blast of high explosives is a forerunner of lasting improvement in all aspects of your life."}, {"dreamName": "Eyes", "dreamText": "Strange or disembodied eyes are considered a prediction of a very beneficial change of events soon to come. To injure your eyes, get something in them, or be otherwise worried about them is a warning that someone is trying to trick you in a business affair. If the main feature of your dream was the beauty of the eyes, the dream is telling you that you can count on the sincere love of those who matter to you. Crossed eyes are a lucky omen for money matters, but a squint, cast, or other defect is a warning against an illicit love affair. Animal eyes are a sign of hidden rivalry or jealousy in your close circle. Exceptionally large and/or wide open eyes signify an inheritance. Blue or light eyes mean a new friendship; dark eyes, a new love affair."}], "F": [{"dreamName": "Face", "dreamText": "This is a straightforward dream in which it’s interpretation is in line with its aspect. If the face was smiling, it signifies pleasant new friends, experiences, and/or financial gains. In-peasant or grotesque, (unless amusingly so) faces portend loss. To dream you are washing your face denotes a necessity to be alone for some past indiscretion; better to make amends! To see the faces of strangers signifies an approaching change of residence. If the main feature of your dream was a facial blemish, you will have a variety of new opportunities to risk your reputation; if you can’t resist at least be very selective."}, {"dreamName": "Factory", "dreamText": "If you dreamed of a busy factory, you will succeed after a hard struggle. If you were working in the factory, you can expect some important and beneficial changes in your life."}, {"dreamName": "Failure", "dreamText": "A dream of contrary. stick to it, you’ll succeed."}, {"dreamName": "Fairy", "dreamText": "Whether the form in your dream was of pixies, gnomes, or just plain garden-variety fairies, these charming creatures promise the materialisation of your dearest wish when you least expect it."}, {"dreamName": "Fall", "dreamText": "A very common dream action generally symbolic of some basic fear in the dreamer’s life, such as fear of a moral lapse, job failure, sexual inadequacy, loss of status, etc; however the prophetic meaning of this dream is strangely very similar in that it indicates setbacks but modified by the details of its action. If in your dream, you fell a long distance, you can expect the reverses to be general and fairly severe; however, if you landed without hurting yourself, they will be upsetting but quite temporary. If you hurt yourself, you should be prepared to endure some real hardships for a time. To fall from a medium height signifies a loss of prestige; to fall to the floor (as from a standing or sitting position) is a warning of danger from false friends. If your dream involved others falling, it indicates triumph over enemies; and if you fell but got up again, you will overcome the obstacles in your path. To fall into water means financial stress, but the water factor and condition must also be considered."}, {"dreamName": "Fame", "dreamText": "To dream of achieving fame yourself is a sort of dream of contrary and suggests you are trying to grasp something which is beyond your reach; High aims are commendable buts it’s healthier to keep them within reasonable bounds. However if your dream involved a famous person, keep trying, because you’ll get help from some unexpected source."}, {"dreamName": "Farm", "dreamText": "A prosperous-looking, well kept farm in your dream predicts a life of abundance, simple pleasures, and good health; a derelict, neglected, or poor-appearing farm signifies a small loss of money, expected gain, or property."}, {"dreamName": "Fat", "dreamText": "Although some of the ancient prophets believed this dream to be a forerunner to an illness, the more modern ones agree that it predicts a happy life of few worries and many pleasures and that the fatter you (or others) were in your dream the better the omen. Eating fat signifies success in love affairs; cooking day indicates business profits."}, {"dreamName": "Fear", "dreamText": "The meaning of this dream can vary greatly according to the details, action, and the circumstances of the dreamer; therefore all those factors should be carefully considered md correlated. As a general guide if you conquered the cause of your dreamed fear and/or the sensation disappeared during the dream, the forecast is that you will overcome your difficulties; however, if the feeling persisted and/or the cause was indefinable, you should expect to have to cope with problems arising from the deceit or dishonesty of someone you trusted. To dream of calming the fears of others indicates the clearing up of a misunderstanding and/or removal of a threat to your peace of mind."}, {"dreamName": "Feast", "dreamText": "A feast, of the harvest or thanksgiving type (as differentiated from a formal banquet) has oddly, a meaning which varies according to the age of the dreamer; for the young to early middle-aged, it is a happy omen of abundance, but for the elderly or old it is a dream of contrary and signifies some unexpected financial difficulty."}, {"dreamName": "Feet", "dreamText": "The interpretation depends on the circumstances of the dream but as a general guide:\nItching feet predict travel.\nTo bathe the feet indicates release from anxiety.\nStrange feet signify new acquaintances.\nAching feet mean family troubles.\nStocking feet forecast an annoying mystery.\nBare feet suggests new experiences with the opposite sex.\nDirty feet are a warning to guard your credit.\nBurning feet signify jealousy.\nCold feet augur disappointment in love.\nA broken foot suggests reverses through carelessness.\nLoss of feet indicates unexpected obstacles.\nHaving your feet stepped on is a warning against indiscreet actions and/or talk.\nChildren’s feet represent small disappointments.\nMany feet walking on a sidewalk predicts a financial loss or loss of an unexpected gain.\nVery large feet promise good health.\nPain from bunions or sore feet forecasts comfort in old age.\nTreatment by a chiropodist predicts a change for the better.\n"}, {"dreamName": "Ferry", "dreamText": "Suitable rewards for your efforts are predicted in a dream of being ferried across water, or of watching a ferry ply to and fro."}, {"dreamName": "Fever", "dreamText": "If the feature of this dream was your own fever, the dream is telling you that the things you worry about most may never happen and that your futile anxiety is compromising your ability to enjoy today. A dream involving high temperatures in others suggests some coming excitement which could be either of a happy or troublesome nature depending on the side action of the dream. If your dream concerned fever on children, it is an augury of success in your current desires."}, {"dreamName": "Fight", "dreamText": "The basic meaning in a dream of fighting is change. For a business person, it signifies a change of enterprise; for an employed person, a change of job, etc. The degree of success or failure you may expect from the change was forecast in the outcome of your dreamed fight. If your dream concerned others fighting, it is a warning against waste of time and money in idle pleasure."}, {"dreamName": "Fingernails", "dreamText": "Long fingernails signify difficulties with the opposite sex; short ones predict an unexpected gift; to polish (or varnish) your nails is a warning against impulsive behaviour which could lead to a scandal; to (painfully) bend back or damage a nail indicates a rather long season of discontent; to cut your fingernails augurs an increase in prestige; to file your nails signifies achievement through your own efforts; if you dreamed of biting your nails or of nails bitten to the quick, a medical checkup would be advisable."}, {"dreamName": "Fire", "dreamText": "The portent of this dream varies greatly according to its details and action, so all aspects should be carefully correlated, but as a general guide:\nA fire is an omen of impending trouble if it burned you; good news if it didn’t.\nTo observe a house or building that is on fire forecasts an urgent appeal for help from a close friend or relative.\nYou can expect an exciting romantic adventure if you built a fire or stirred one up with a poker.\nTo dream of putting out a fire or escaping from one predicts ultimate success over all obstacles.\nA small cheerful fire in a fireplace indicates contentment.\nA dream of setting fire to a house, building, or anything of value is telling you to control your temper or be prepared for serious consequences.\nA roaring fire (contained in a grate) signifies new hope after a time of disappointment.\n"}, {"dreamName": "Fireworks", "dreamText": "A sort of dream of contrary, as it forecasts obstacles to the accomplishment of some cherished plan, and the more spectacular the display was in your dream, the longer will be your season of frustration."}, {"dreamName": "Fish", "dreamText": "To see fish swimming freely in clear water is an omen of wealth and personal power. If you were fishing in clear water and could see the fish bite, it indicates that you will discover or acquire some knowledge which can be used very advantageously. Dead fish either in their natural habitat or in a market are an omen of disappointment or discouragement. To dream of catching a fish is an augury of success, and the bigger the fish the bigger the success; and if you saw a fish moving its fins, you can expect to be freed of any worrying responsibilities. If your dream featured carp, it is a warning against subjecting yourself to criticism by ill-considered actions. Eating or cooking fish (except carp) is considered a general good omen for your current undertakings. If your dream involved a fishnet, it means reverses if the net was empty, success if it was full, and disappointment if it was torn, unless it was torn but still had fish in it, in which case it signifies success of a limited nature. Tropical or goldfish in tanks, bowls, or pools indicate ephemeral pleasures. Baiting a fishhook in a dream is a prediction of a passionate new love affair - and if you’re not eligible, it will be someone close enough to share the excitement with you; but to get a fishhook stuck in any part of the body is a warning against deceitful acquaintances. To dream of seeing a variety of food fish (live) of rather uncommon species, such as salmon, trout, etc, indicates an increase in social activity and prestige. A dream of trying to hold a fish which wriggles out of your grasp has the obvious meaning and you must be prepared to lower your sights or find a new liaison. Oddly enough, really rotten fish are an exception to the dead fish rule and are a sign of a sudden large increase in income."}, {"dreamName": "Flashlight", "dreamText": "A dream featuring the use of a flashlight out of doors is a forecast of help from a new influential friend; a flashlight used inside is a warning against impulsive behaviour in the face of strong temptation."}, {"dreamName": "Flavour", "dreamText": "To taste an unidentifiable flavour is a good omen if you liked it; if not, it signifies petty arguments."}, {"dreamName": "Flirt", "dreamText": "An omen of social success if kept within the bounds of good taste, but if done with malicious intent, it signifies trouble brewing in domestic affairs."}, {"dreamName": "Floating", "dreamText": "A marvelous symbol of success, prosperity, and all that you desire if you had no trouble staying afloat, and even if there was some difficulty, it only delays the success by reason of obstacles which you can easily overcome. To use a rubber or plastic float is a sign of reconciliation."}, {"dreamName": "Flowers", "dreamText": "Fresh brightly coloured flowers featured in your dream, whether growing out of doors or arranged indoors, are an auspicious omen of great personal happiness. Of the flowers were dead or wilted or if you threw them away, the dream is warning you that overconfidence and/or carelessness also goes before a fall. Artificial flowers predict a situation where you will be under pressure to act against your principles; don’t allow yourself to be influenced. Wild flowers signify a happy exciting adventure."}, {"dreamName": "Flying", "dreamText": "This is one dream symbol on which practically every source from Artemidorus on down agrees. It represents the dreamer‘s basic ambition, but the interpretation of flying (like a bird) is modified by the details of the flight and its conditions, so the surroundings, weather etc., must be correlated with the action, but as a general guide:"}], "G": [{"dreamName": "Gain", "dreamText": "The greater the profit or gain was, the more carefully you must guard your resources, unless you profited by taking an unfair advantage or by dishonest means, in which case the dream prophesies a successful business deal or the recovery of a loss."}, {"dreamName": "Gale", "dreamText": "You may be buffeted by your current difficulties, but you will eventually emerge unbowed."}, {"dreamName": "Gang", "dreamText": "To dream of being a member of a gang suggests a tendency to drift with the tide. To be the leader of a gang indicates stagnation through lack of initiative. To be frightened or threatened by a gang signifies a period of depression— pull up your socks and try some positive action. To be mugged or beaten by a gang is a warning that you are on the verge of financial embarrassment; put a tight rein on the spending."}, {"dreamName": "Garbage", "dreamText": "Oddly enough, a dream of garbage is a contradictory omen and predicts a future success beyond what you now believe possible."}, {"dreamName": "Geese", "dreamText": "To see them—whether swimming, flying, or on the ground— is a forecast of improving conditions, but if you heard them honking, you are being warned that someone is trying to con you with sweet talk."}, {"dreamName": "Genitals", "dreamText": "This is a rather straightforward indication of your sexual attitudes and/or feelings, as follows:\nTo dream of your own of others' sex organs being healthily normal signifies a satisfactory love life.\nDiseased or deformed sex organs indicate that you are either overdoing it or being dangerously promiscuous.\nUnusual sex organs are a sign of underindulgence and a little initiative might be a good idea.\nThe exposing of sex organs indicates that you are on the verge of being dangerously sex-starved and professional advice would be useful.\nPain in the genitals suggests you should see your doctor.\n"}, {"dreamName": "Ghost", "dreamText": "The meaning of this dream varies according to the circumstances. If the ghost simply appeared, it is an omen of general good luck; however, if you were frightened by it or it spoke to you, it is a warning that some powerful pressure will be brought to bear on you to join in a scheme or activity which goes against your principles. Resist the temptation with all the strength you can muster, and if necessary, get help from a trusted friend or adviser."}, {"dreamName": "Girl", "dreamText": "A young girl whom you recognize is a sign of encouraging prospects; if she is a stranger, it forecasts some sudden surprising news. If a man dreams of being a girl, a visit to a psychologist might be helpful."}, {"dreamName": "Gold", "dreamText": "Easy come, easy go is the message contained in a dream featuring the precious stuff in any form, e.g. in bars or nuggets. However, interpretation depends on action and details. Gold cloth, garments, embroidery, or trimmings signify honors and/or recognition; looking for gold indicates that a successful change of unsatisfactory conditions can be made through your own initiative. Finding and/or mining, melting, or working with it is a reminder that \"all is not gold that glitters\" and you must guard against a tendency to be too easily taken in by appearances. Hiding it suggests that you are not aggressive enough about protecting your own interests; take positive action. Stealing or counting gold is a warning that the love of money is a root of evil and can be very costly. Items made of gold, such as tableware, jewelry, medals, coins, or gold-plated items, foretell steady financial gain."}, {"dreamName": "Gooseflesh", "dreamText": "If you broke out in goosebumps, the message is that you are jeopardizing a valued relationship by taking it too much for granted; mend your ways."}, {"dreamName": "Grave", "dreamText": "No matter what the circumstances, this is not a happy omen. A new grave banked with flowers is a forecast of a broken promise; a neglected grave signifies heartache; an open grave predicts sad news from a distance; to fall into a grave is a sign of lost friendship; and to dig a grave or to be aware of your own burial place is a warning that you are being thwarted by secret enmity."}, {"dreamName": "Greyhound", "dreamText": "Strangely, a greyhound is a symbol of triumph if it was not running, but to dream of a running greyhound is a warning that you have bitten off more than you can chew and an alteration in your future plans would be advisable."}, {"dreamName": "Groan", "dreamText": "Groaning signifies some kind of financial embarrassment; make sure your tax accounts are in good order. If you heard someone else groan, it indicates a period of petty annoyances."}, {"dreamName": "Guilt", "dreamText": "Others being guilty signifies untrustworthy friends; to be guilty oneself or be aware of a personal sense of guilt indicates a need to make amends for some past injustice."}, {"dreamName": "Gum", "dreamText": "Whatever the action, chewing gum is a warning against confiding in new acquaintances and/or against casual affairs."}, {"dreamName": "Guns", "dreamText": "Whether you saw, heard, or used it, any type of gun forecasts an injustice done either to you or to someone in your close circle which you will have to fight hard to overcome. Loading a gun is a strong caution against giving way to temper. Gunpowder indicates a sudden change of occupation for a man; for a woman, it means an unexpected change of residence."}], "H": [{"dreamName": "Habit", "dreamText": "You can expect to have some difficulty in regard to a useful social contact if your dream featured a personal habit such as smoking, drinking, or chewing. A religious habit suggests that you will have to be firm about breaking off a relationship which has become a drag."}, {"dreamName": "Ham", "dreamText": "No matter what, ham is a good omen. Smoking it signifies a prosperous year ahead, baking it indicates that your current difficulties will result in ultimate good fortune, and eating it in any form predicts business luck."}, {"dreamName": "Hammer", "dreamText": "To hear or see a hammer being used is fortunate; if you used it yourself, it predicts a satisfying achievement."}, {"dreamName": "Hamper", "dreamText": "A laundry hamper, if empty, signifies an emotional upset; if full, good progress is indicated. A picnic or food hamper forecasts pleasant family unity."}, {"dreamName": "Handcuffs", "dreamText": "Unlike tied hands, being handcuffed promises a release from worry. To see others handcuffed signifies security and protection, and to snap them on someone predicts an unexpected improvement in your lifestyle."}, {"dreamName": "Hanging", "dreamText": "A season of good luck will follow if you dreamed of being hanged or seeing another hanged. However, to dream of being a hangman is a strong warning to refrain from criticizing lest you be criticized yourself."}, {"dreamName": "Hate", "dreamText": "To feel hatred suggests that you should beware of misjudging someone, but to be hated predicts an improvement in your affairs through the influence of sincere friends."}, {"dreamName": "Headlights", "dreamText": "Headlights moving toward you are a warning that a situation you have allowed to drift is a potential danger unless you take quick action."}, {"dreamName": "Heaven", "dreamText": "To dream of heaven predicts a change which may not suit you now but will prove, in the long run, to be very beneficial."}, {"dreamName": "Hell", "dreamText": "The classic concept of hell is a forecast of an increase in income and/or material wealth but a decrease in social popularity. Returning from hell indicates that you will face a terrific temptation to do something contrary to your principles."}, {"dreamName": "Hide", "dreamText": "If you dreamed you were hiding, you are contemplating some action which you may suspect or know you may later regret; don't be hasty. Hiding some object or article suggests you are being secretive concerning a problem with which you could do with advice; confide in a trusted friend."}, {"dreamName": "Hinge", "dreamText": "A rusty hinge predicts difficulties in connection with family or personal affairs; a squeaky hinge signifies that you will have to combat some malicious gossip."}, {"dreamName": "Hive", "dreamText": "A beehive is a symbol of prosperity and freedom from worry, unless you upset it or let the bees out, in which case it signifies troubles of your own making which will become serious if you allow them to."}, {"dreamName": "Hold", "dreamText": "Holding something in your hand predicts recognition in community affairs; holding someone in your arms indicates coming personal happiness."}, {"dreamName": "Hole", "dreamText": "To step or fall into a hole is a warning against undesirable companions; reassess your relationships. A hole in a garment forecasts improving luck in financial matters. A dream of digging a hole predicts a sudden trip, and to observe holes made by others indicates easier times ahead."}, {"dreamName": "Hood", "dreamText": "To dream of yourself or others wearing a hood is a warning of deception by someone you trust. Be more selective about where you place your confidence."}, {"dreamName": "Hornet", "dreamText": "Oddly enough, a dream of suffering the sting of these creatures is an omen of success in your current undertakings; otherwise, they must be considered a warning against hostile associates."}, {"dreamName": "Hospital", "dreamText": "If you were taken to a hospital or were a patient in one, the dream is telling you that you are in imminent danger of being overwhelmed by some load you are trying to carry alone; don't be a proud fool— ask for help. Visiting a hospital or helping in one predicts surprising news."}, {"dreamName": "Hounds", "dreamText": "Being chased by bloodhounds suggests you should use more restraint regarding your indulgence in sensual pleasures."}, {"dreamName": "House", "dreamText": "An old house signifies a reunion or renewal of an old association. A new house predicts financial security. Building a house or seeing one under construction forecasts unexpected gain, possibly through a legacy; buying a house indicates a short but exciting love affair, while selling augurs a release from pressuring responsibilities. An empty house or one being demolished suggests you are grieving over a recent loss, broken relationship, or missed opportunity; don't despair, time really does heal all things."}, {"dreamName": "Hum", "dreamText": "The sound of humming signifies news from a distance; if it stopped for no particular reason, the news will be startling. Humming yourself augurs a social uplift."}, {"dreamName": "Hunting", "dreamText": "An obstacle dream. Whether you were looking for something that was lost or hunting for game, the significance depends on the outcome of the quest. If you were successful in the dream, you will soon overcome your difficulties; if not, you will have to struggle yet awhile."}, {"dreamName": "Hut", "dreamText": "The lowlier the hut, the more secure will be your future."}, {"dreamName": "Hypocrite", "dreamText": "If the hypocrisy came from someone else, you are being warned against making hasty decisions or judgements, but if you were guilty of the hypocrisy, it is a warning to guard your health."}], "I": [{"dreamName": "Idiot", "dreamText": "Whether you dreamed of being an idiot yourself, or of others who were so afflicted, it signifies success in all your undertakings through your own intelligent competence."}, {"dreamName": "Illness", "dreamText": "If your dream involved others being ill, you can expect to be upset by a broken promise."}, {"dreamName": "Impotence", "dreamText": "Success in your love life, as well as your other interests, will follow as surely as the wheels of a cart follow the horse."}, {"dreamName": "Infidelity", "dreamText": "A dream of being unfaithful in any way is warning you to be more discriminating in regard to your choice of playmates."}, {"dreamName": "Ingratitude", "dreamText": "If you suffered from it, the omen is a happy one, but if you were guilty of it, your conscience is being gnawed by the worm of remorse. Try to make amends."}, {"dreamName": "Inheritance", "dreamText": "Receiving one in a dream is usually a straightforward prediction of a legacy to come."}, {"dreamName": "Insult", "dreamText": "This is a classic example of a contradictory omen; whether you took it or dished it out, an insult signifies loyalty from your friends and/or esteem from your associates."}, {"dreamName": "Intercourse", "dreamText": "The interpretation of this dream depends on the details. If you were personally involved and you enjoyed the experience, it is obviously an omen of happy adjustment to your circumstances. If your dream featured others having intercourse, the meaning relates to whether or not your reaction was unpleasant. If it was, it is likely you are repressing an emotional problem and some psychological counseling might prove beneficial; if it was not, contentment and success will soon be yours."}, {"dreamName": "Itch", "dreamText": "This dream indicates that you are a worrywart and you could be your own best friend if you'd give up nourishing yourself on gloom and start emphasizing the positive."}], "J": [{"dreamName": "Jab", "dreamText": "A rather straightforward symbol which takes its meaning from the action or sensation involved. If you felt (or were given) a jab, it is telling you that you are standing in your own way by underestimating yourself; try to be more forthcoming. However, if you were jabbing others, you must guard against a tendency to be overaggressive. Remember that you can catch more flies with honey than with vinegar."}, {"dreamName": "Jail", "dreamText": "An obstacle dream. Your difficulties will be short term if you escaped or were released; otherwise, expect a long, tough struggle. If your dream featured others in jail, it signifies freedom from worry."}, {"dreamName": "Jealousy", "dreamText": "You can expect to be heavily involved in a series of problems concerning your romantic (or marital) affairs, your profession (or job), and/or your important friendships. However, if the element of jealousy was directed at you, it signifies that some overt hostility under which you now suffer will eventually turn to your advantage."}, {"dreamName": "Jilted", "dreamText": "A contradictory dream that indicates success in your love affairs or constancy in your marriage, whichever applies."}, {"dreamName": "Joints", "dreamText": "Oddly enough, painful joints predicts an increase in material wealth, unless you actually suffer from such trouble, in which case the dream obviously has no symbolic significance."}, {"dreamName": "Judge", "dreamText": "A time of trials, troubles, and thankless tasks is forecast in a dream which features a judge— either being a judge or being judged. However, you can console yourself with the assurance that the troubles will be temporary."}, {"dreamName": "Jungle", "dreamText": "You are being warned to guard your resources and avoid getting involved in someone else's financial problems, unless you were walking in the jungle, in which case it indicates foolish romantic entanglement which you would be wise to cut before it becomes a serious problem."}, {"dreamName": "Justice", "dreamText": "You may, from time to time, have to suffer some injustice in the form of undue criticism, but a successful future will surely be yours if you dreamed of the lady with the scales."}], "K": [{"dreamName": "Kangaroo", "dreamText": "If the kangaroo was jumping and had a young one in her pouch, it signifies an unexpected and exciting trip."}, {"dreamName": "Kettle", "dreamText": "If it was bright and/or bubbling merrily away, it signifies domestic contentment, but if it was dull or dry, it indicates that some unexpected expense is looming over you. Hold on to your money— you're going to need it."}, {"dreamName": "Kidnapping", "dreamText": "If you were kidnapped, you are likely to be embarrassed by the company you have been keeping; a change of companions would probably be beneficial. However, if you did the kidnapping, you are being warned to guard your valuables against theft or loss, and if you can't do that, then be sure your insurance is in order. To dream of a kidnapping in which you were not personally involved is a sign of sudden important changes in the offing."}, {"dreamName": "Killing", "dreamText": "If you killed someone, whether intentionally or by accident, it signifies a period of severe emotional stress during which you must make a heroic effort to control your temper. Witnessing a killing portends a change which will not be entirely to your liking. Seeing others kill insects or animals prophesies help from friendly sources, but killing them yourself predicts that you will overcome obstacles through your own efforts."}, {"dreamName": "Kiss", "dreamText": "The meaning of a dream kiss depends on the circumstances involved. If the kissing was pleasant and proper, a sincere token of affection, it predicts happiness and contentment, but if it was of a perfunctory, meaningless, insincere, or illicit in nature, it signifies a false friend or disappointment in a love affair. Kissing babies or small children forecasts success in a difficult undertaking. Trying to avoid a kiss from someone you dislike portends a minor illness or vexing experience."}, {"dreamName": "Knife", "dreamText": "A sharp knife signifies personal strife; a rusty one means family troubles, and a broken one indicates failure in love. An open switchblade knife or penknife predicts legal troubles; a closed one suggests financial reverses, and a dull one portends hard work with little reward. To cut yourself with a knife is a warning that you could be embarrassed by a neglected creditor; don't stretch goodwill too far."}, {"dreamName": "Knock", "dreamText": "If you were doing the knocking, the dream is warning you against loose talk and/or companions; however, if you merely heard the knocking (or saw others doing it), it represents the sound of approaching money."}], "L": [{"dreamName": "Labyrinth", "dreamText": "Obviously another obstacle dream. If you found your way out or were not worried by the maze, you can expect to solve your problems with a minimum of effort; however, if you were lost of frightened, you can expect to be frustrated by some puzzling opposition and a change of direction might be advisable."}, {"dreamName": "Lake", "dreamText": "The interpretation of this dream depends on its various aspects, such as the condition of the water, the weather, etc., but as a general guide...\nA stormy lake predicts a failure which, if you refuse to let it depress you, will lead to an important benefit.\nA calm lake in good weather signifies smooth sailing on the sea of life.\nA moonlit lake augurs a happy love life.\nTraveling around a lake or observing one from the air is a sign of passive stagnation; try to find some new interests.\nWading or walking into a lake indicates unnecessary anxieties; take life more calmly.\n"}, {"dreamName": "Lane", "dreamText": "A dream featuring a narrow or country lane is a caution to be more discreet in your affairs with the opposite sex."}, {"dreamName": "Lantern", "dreamText": "A swinging lantern is a warning of danger through indiscriminate sex relations; cool it! If your dream featured a lantern blown out by the wind, you are likely to have some minor legal troubles."}, {"dreamName": "Laryngitis", "dreamText": "Losing your voice is a warning not to gamble or take any unnecessary risk for the next few weeks."}, {"dreamName": "Late", "dreamText": "If you were late, it's your conscience telling you to refrain from making promises you can't keep; if others were late, it's a warning that you need to curb your extravagance to avoid financial difficulties."}, {"dreamName": "Lava", "dreamText": "Molten rock from a volcano is a sign that your social life will become more exciting. You may have to juggle your budget to keep up, but you should find the effort worthwhile."}, {"dreamName": "Lavender", "dreamText": "To see lavender growing or to smell its aroma in a dream predicts pleasant affairs with the opposite sex."}, {"dreamName": "Learn", "dreamText": "If, in your dream, you were seriously trying to learn a new skill, language, or subject which you found difficult, the dream is telling you that you may have bitten off more than you can chew and you had better rethink your situation. On the other hand if the dreamed learning came easy, it predicts a rise in prestige through your own diligent efforts."}, {"dreamName": "Leather", "dreamText": "Anything made of leather is, as a general rule, a lucky omen, but the meaning will be modified by the type of leather, the action, and the article involved."}, {"dreamName": "Leech", "dreamText": "This repulsive bloodsucker predicts that you are likely to have an unexpected demand on your resources, but don't get depressed— the strain will be temporary."}, {"dreamName": "Library", "dreamText": "A generally fortunate omen but particularly auspicious for those engaged in artistic or creative activities."}, {"dreamName": "Lick", "dreamText": "Being licked by an animal predicts that you will shortly be asked to advise a friend or relative in a serious matter; be as helpful as possible but avoid getting personally involved. Being licked by a baby forecasts a happy outcome to your problems. If your dream concerned licking something yourself, it indicates satisfaction in passing small matters."}, {"dreamName": "Lie", "dreamText": "If you told lies, you can expect to have trouble due to your own foolish behavior; but if your dream featured others telling whoppers, it predicts help from an unexpected source."}, {"dreamName": "Lips", "dreamText": "Thin or cruel lips are a warning against making hast judgement of others. Beautiful lips signify a successful sex life and happiness in love. Thick, overly sensual, or ugly lips forecast failure in love but success in business. Chapped, dry, or sore lips indicate a loss of status or business reverses. Children's or a baby's lips are a sign of true friendship where you least expected it."}, {"dreamName": "Loneliness", "dreamText": "To dream of being lonely is a sign that you won't be."}, {"dreamName": "Loss", "dreamText": "This is generally an obstacle dream, and its meaning must be related to the article lost and whether or not you eventually found it. If you lost something of great value, the dream is warning you that if you try to be too sharp you can end up cutting yourself."}, {"dreamName": "Lottery", "dreamText": "Family troubles are forecast in any dream concerning a lottery or lottery tickets."}, {"dreamName": "Love", "dreamText": "Sincere love is a forecast of happiness and contentment through a healthy and intelligent adjustment to the conditions of life, but illicit love or sheer lust is a portent of disappointment or failure due to your own greed. Observing the lovemaking of others predicts success in your current undertakings."}, {"dreamName": "Lungs", "dreamText": "Suffering any form of upper respiratory discomfort is a warning to see your doctor, unless you actually have a chest complaint, in which case the dream has no special significance."}], "M": [{"dreamName": "Magic", "dreamText": "Any form of magic predicts unexpected changes. Being mystified and/or amused by a magician indicates a reunion with a long-lost friend or the rekindling of a past love affair."}, {"dreamName": "Magpie", "dreamText": "You are flogging a dead horse in regards to a matter of unrequited love or personal friendship, and these birds are telling you that now is the hour to give up this enervating exercise. New interests will soon console you."}, {"dreamName": "Maid", "dreamText": "The meaning of this dream depends on your circumstances. If the maid works for you, it is a good omen if you actually have one; if not, it signifies loss of finances or status. For a woman to dream of being a maid is a sign that she can expect to regain lost social status."}, {"dreamName": "Mansions", "dreamText": "If the mansion was luxuriously furnished, be prepared to accept some changes that will not be to your liking; however, if it was empty or in bad condition, you can expect the change to be for the better, although it may not at first appear that way."}, {"dreamName": "Map", "dreamText": "Maps, as one would expect, signify journeys and changes. The larger the map was, the more distant will be the travel and/or the greater the change. The more brightly colored the map, the happier the forecast. If you were drawing a map, the travel or change will have a lucky aspect providing you used a pencil; if you used a pen, it signifies complications."}, {"dreamName": "Marshmallow", "dreamText": "Toasted or plain, those mushy morsels signify an unusual new friend of the opposite sex."}, {"dreamName": "Martyr", "dreamText": "To dream of being a martyr is a warning that your greed could alienate those you care about; any other dream concerning martyrdom foretells recognition for work well done, either yours or that of someone close to you."}, {"dreamName": "Mascot", "dreamText": "You can expect a sudden change of events which will make a beneficial alteration in your future prospects."}, {"dreamName": "Mask", "dreamText": "Deceit from an unsuspected quarter is indicated in a dream of a person (or people) disguised by a mask. If you wore one yourself, it predicts that you will end up with a profit from a scheme intended to cheat you."}, {"dreamName": "Mermaid", "dreamText": "A mermaid is a symbol of your current love or personal affairs, and its meaning depends on the nature of the action and the general atmosphere of the dream. If those elements were pleasant, you can expect things to go well, but if they were unpleasant or generated a feeling of confusion or dissatisfaction, the dream portends disappointment."}, {"dreamName": "Mine", "dreamText": "To dream of working in any kind of mine predicts eventual wealth through your own efforts."}, {"dreamName": "Mirror", "dreamText": "Although sources disagree widely on the meaning forecast by mirrors, they practically all agree that a broken mirror signifies sad news and/or a troubled period ahead. To see yourself in a mirror is a warning of deceit among your friends, and to see others reflected portends dishonesty in your associates."}, {"dreamName": "Mob", "dreamText": "An angry mob is a warning that some activity which you are being urged to join could prove dangerous. Be firmly cautious."}, {"dreamName": "Morgue", "dreamText": "Difficult and/or disagreeable duties are forecast here. If you dream of being aware of your own corpse in a morgue, it is warning you to take better care of your health. A medical checkup would probably prove beneficial."}, {"dreamName": "Motor", "dreamText": "Any smoothly running motor is an omen of solid progress, but if it gives any trouble or won't start, it suggests that a reassessment of your aims with an eye to change of direction might prove advantageous."}, {"dreamName": "Murder", "dreamText": "See Killing."}, {"dreamName": "Mushrooms", "dreamText": "Mushrooms growing forecast the accumulation of wealth through intelligent speculation. Picking the mushrooms predicts prosperity and protection; eating them signifies an improvement in status due to influential contacts."}, {"dreamName": "Myth", "dreamText": "A dream concerning any of the great mythical characters or any of the ancient myths is telling you that flattery can get you everywhere, so put your tongue in your cheek and start spreading the oil."}], "N": [{"dreamName": "Naked/Nudity.", "dreamText": "f the nakedness was your own, you can expect a stroke of money luck or an improvement in circumstances, but dreaming of others being naked suggests that you will inadvertently uncover a deception within your closest circle."}, {"dreamName": "Nausea", "dreamText": "Being nauseous portends a challenge to your honesty or integrity; be on guard against \"help\" from untrustworthy friends or associates."}, {"dreamName": "Navel", "dreamText": "If it concerned your own navel, it is likely you will soon be considering a new venture which could produce long-term benefits. If it was someone else's navel, this indicates a new love affair in the making. A dream of Buddha contemplating his navel augurs a period of good fortune."}, {"dreamName": "Neighbor", "dreamText": "A helping a neighbor predicts an unexpected gift or minor legacy, but quarreling with neighbors is a warning of possible troubles."}, {"dreamName": "News", "dreamText": "The worse the news, the better will be the news you get, and vice versa."}, {"dreamName": "Nipple", "dreamText": "An adult taking nourishment through a nipple means that your personal debts are on the verge of getting out of hand, but if it's a baby or a child, there will be a happy release from worry. If your dream was of the erotic type, the meaning depends on the details. A dream of firm pleasantly colored nipples is a favorable omen and if they were very large, they predict an increase in material wealth. Painful or ulcerated nipples warn you that you could do with a medical check-up. Having more than two signifies that your only sex problem will be discretion in your choice of partners. You'll have no lack of opportunity. Being touched by someone else's nipples indicates happy tidings."}, {"dreamName": "Nugget", "dreamText": "If you found (or received) a nugget of any precious metal, you can expect an opportunity which would lead to a spectacular change of circumstances and/or surroundings in the near future."}, {"dreamName": "Numbness", "dreamText": "A feeling of numbness generally arises from an external physical condition such as too tight bedclothes or lying in an awkward position; however, it could indicate that a medical checkup would be a good idea."}, {"dreamName": "Nurse", "dreamText": "A professional nurse signifies marriage for the single and family unity for the married, unless you a trained nurse or in daily contact with them, in which case the dream has no prophetic significance."}, {"dreamName": "Nymph", "dreamText": "A nymph predicts an interesting romantic experience."}], "O": [{"dreamName": "Oasis", "dreamText": "Success of an important magnitude in an exciting new endeavor is forecast."}, {"dreamName": "Obituary", "dreamText": "Good news is on the way."}, {"dreamName": "Occult", "dreamText": "Occult matters predict that you will come into possession of some confidential information which will be of great advantage to you."}, {"dreamName": "Orchids", "dreamText": "These exotic blooms are a warning to curb either your extravagance or your exotic habits, whichever applies."}, {"dreamName": "Orgy", "dreamText": "A warning that your excesses or your repressions (whichever applies) could get you into trouble; moderation is the key to contentment."}, {"dreamName": "Orphan", "dreamText": "You are being warned that your self-centered attitude could lose you a valuable friendship if your dream featured an orphanage, but any dream concerning orphans predicts a sudden gain in material wealth from a previously unknown source or an unexpected legacy."}, {"dreamName": "Owl", "dreamText": "This hooting night bird is an omen of reverses and/or disappointments, unless you drove it away, in which case you can expect an improvement in your circumstances. An owl in the house forecasts family discord."}], "P": [{"dreamName": "Pallbearer", "dreamText": "A rise in status is forecast by a dream of being a pallbearer."}, {"dreamName": "Panda", "dreamText": "This lovable Chinese bear is telling you that if you'll just stop feeding your worries, they'll go away."}, {"dreamName": "Parachute", "dreamText": "If the use of the parachute was trouble-free, you can expect a happy love life, but if there was any difficulty involved, you are likely to be let down by someone on whom you relied."}, {"dreamName": "Paralysis", "dreamText": "Generally, this disability, whether your own or someone else's, suggests an emotional conflict or sexual inhibition. If the paralysis was total, it is likely that you are fighting your conscience over something you want to do and feel you shouldn't. If the paralysis was only partial, it indicates a fear of frigidity, impotence, or latent homosexuality. Alternatively, this dream could arise from a repressed desire for freedom from responsibility or from an organic malfunction. In any case, medical or psychological advice would be beneficial."}, {"dreamName": "Park", "dreamText": "A public park predicts exciting love affairs, unless it was untidy or in poor condition, in which case it portends a lonely period or readjustment."}, {"dreamName": "Path", "dreamText": "A broad path predicts a happy life and good friends, but a narrow one portends struggle and deceit; however, you can overcome it by being cautious in your close associations."}, {"dreamName": "Pendulum", "dreamText": "A sudden change of plans will upset your regular routine; however, if you can manage to accept the change without a display of undue anxiety, it will prove to be ultimately beneficial."}, {"dreamName": "Penny", "dreamText": "A new or shiny penny portends deceit in someone you trust; giving pennies away predicts money luck, but receiving a penny (or pennies) indicates financial loss."}, {"dreamName": "Perspiration", "dreamText": "This dream is reminding you that the formula for success is inspiration plus perspiration, so don't rest on your oars; if you want to enjoy the rewards, you'll have to endure the efforts."}, {"dreamName": "Photographs", "dreamText": "Looking at photographs forecasts the pleasing renewal of an old friendship."}, {"dreamName": "Picnic", "dreamText": "The meaning depends entirely on the general atmosphere (pleasant or awkward) and on the details of the other elements involved, which must be correlated."}, {"dreamName": "Pirate", "dreamText": "Storybook-type pirates suggest a strong inclination to enter into an exciting new venture, but be cautious about your associates and investigate before you invest."}, {"dreamName": "Planets", "dreamText": "If your dream featured other planets, it suggests a strong desire for adventure and/or change from your present routine which you feel would be unwise; try to resolve the conflict by finding a new extracurricular interest as an outlet for your unsatisfied drive."}, {"dreamName": "Plow (Plough)", "dreamText": "A horse drawn plow signifies slow but steady progress in all that concerns you; a motor drawn plow is a forecast of achievement with a strong assist from lady luck."}, {"dreamName": "Police", "dreamText": "Police are a symbol of security in your life, and even if your dream involved trouble with them, it is an omen that signifies that you will get unexpected help with a current problem."}, {"dreamName": "Pool", "dreamText": "A swimming pool is a symbol of social gaiety, unless it was empty, dirty, or in poor condition, in which case it is a warning against gambling or speculation. A garden pool is a happy omen for love affairs. Playing pool suggests that you would benefit from cultivating new interests and new companions."}, {"dreamName": "Porch", "dreamText": "Sitting on a porch forecasts personal contentment, but sleeping on one portends social embarrassment."}, {"dreamName": "Prayer", "dreamText": "If the prayer was yours, peace of mind and contentment with your lot in life are promised; if you heard others pray, it is a sign of loyal and lasting friendship."}, {"dreamName": "Pregnancy", "dreamText": "For a woman, this dream forecasts a happy increase in material wealth, but for a man, it is a warning against indiscriminate sexual relations."}, {"dreamName": "Prize", "dreamText": "Receiving a prize suggests that you will be successful in your current endeavors; giving a prize indicates an increase in material wealth, possibly through an inheritance."}, {"dreamName": "Profit", "dreamText": "You are being cautioned to keep your private affairs to yourself for the next few weeks and to avoid being drawn into the personal affairs of others."}, {"dreamName": "Publish", "dreamText": "If you dreamed of having something published, you can expect an improvement in your circumstances; but if it involved being (or meeting) a publisher, it is a warning that you should guard against financial loss by relying on competent advice rather than on your own judgement."}, {"dreamName": "Pulse", "dreamText": "An exciting new interest in life is forecast if your dream concerned your own pulse, but if it featured any other pulse, it is cautioning you against getting too confidential too soon with recent acquaintances."}, {"dreamName": "Puncture", "dreamText": "A puncture is telling you to stop being a victim of your own inflexibility. Try giving a chance to someone else's ideas occasionally; you might discover new horizons."}, {"dreamName": "Purse", "dreamText": "You are likely to be pleasantly surprised by a long overdue payment or repayment if you dreamed of finding a purse, but if you lost one, it signifies disillusionment with a friend or lover."}, {"dreamName": "Puzzle", "dreamText": "An obstacle dream; its meaning will relate to whether (or how easily) you solved it."}, {"dreamName": "Pyramid", "dreamText": "You can expect a pleasant change of pace (possibly foreign travel) unless the pyramid was lying on its side, inverted, or damaged, in which case it suggests approaching family or financial worries."}, {"dreamName": "Python", "dreamText": "This big snake signifies that someone is trying to squeeze you by intimidation. No matter how strong the pressure, stand your ground and victory will be yours."}], "Q": [{"dreamName": "Quantity", "dreamText": "A very large quantity of anything suggests you are in danger of being overwhelmed by your responsibilities; keep calm and you'll find that you can manage."}, {"dreamName": "Queue", "dreamText": "A benefit of family advice or generosity is forecast in a dream of waiting in a queue or observing one."}, {"dreamName": "Quicksand", "dreamText": "Pulling someone (or something) out of quicksand predicts a steadily increasing income; sinking in quicksand is a strong warning against mixing or prying into the personal affairs of others."}], "R": [{"dreamName": "Rabbit", "dreamText": "Many rabbits signify an increase in responsibilities which will be pleasant rather than onerous; rabbit fur or anything made of it is a sign that you will eventually be able to afford luxuries."}, {"dreamName": "Raffle", "dreamText": "Winning a raffle is a straightforward omen of an upcoming lucky phase. If you're inclined to take an occasional gamble, this would be a propitious time to do it."}, {"dreamName": "Raft", "dreamText": "The meaning depends on various elements, such as the condition and kind of water, which must be correlated to the action, but as a general guide: floating on a raft suggests that your indolence will lead to someone else's gain, while building or repairing a raft is a forecast of achievement through your own efforts."}, {"dreamName": "Rainbow", "dreamText": "Whatever the context may have been, if the main feature of your dream was a rainbow, it predicts the end of all your troubles followed by great happiness."}, {"dreamName": "Rape", "dreamText": "Whatever form it took, this act is a warning to avoid careless companions or behavior."}, {"dreamName": "Rats", "dreamText": "These rodents portend trouble due to active but hidden jealousy; however, if they were white you will be protected by benign forces. If you heard them gnawing but didn't actually see them, it is a warning that you are wasting your life in meaningless pursuits."}, {"dreamName": "Read", "dreamText": "Reading is a generally favorable omen signifying progress. If you were reading aloud, it predicts help from outside sources; to hear someone else read foretells of future comfort and peace of mind."}, {"dreamName": "Regret", "dreamText": "You will soon have reason to rejoice."}, {"dreamName": "Relief", "dreamText": "If you dreamed of being relieved, you can be sure that better times are just around the corner."}, {"dreamName": "Religion", "dreamText": "Small troubles are portended if your dream featured the interior of a church, but experiencing a spiritual feeling augurs contentment and peace of mind."}, {"dreamName": "Rescue", "dreamText": "Avoid all unnecessary risks, as you are likely to be in an accident-prone phase for a few weeks following a dream of being rescued; but if your dream involved rescuing someone else, or others being rescued, it signifies sudden success in overcoming a previously sticky obstacle."}, {"dreamName": "Revenge", "dreamText": "Chagrin and personal problems arising from your lack of sympathy with any viewpoint except your own are indicated in a dream of revenge. Remember that you must give consideration if you expect to get it."}, {"dreamName": "Reward", "dreamText": "To receive a reward predicts an unusual stroke of luck; to offer one is a caution against complacency."}, {"dreamName": "Rich", "dreamText": "If your dream concerned being more affluent than you actually are, it is, unfortunately, a contradictory omen that portends a protracted period of patience before your circumstances will improve."}, {"dreamName": "Robbery", "dreamText": "Losing your valuables in a robbery signifies unexpected gain, unless the robbery involved a loss of money, in which case it is a warning to be careful how you handle your cash."}, {"dreamName": "Rocking Horse", "dreamText": "Whether you rode it yourself or saw someone else sitting on it, a rocking horse is a fortunate omen for your personal interests."}, {"dreamName": "Rosary", "dreamText": "Telling (or counting) the beads of a rosary is a sign of greater contentment than you have previously known."}, {"dreamName": "Row", "dreamText": "If you dreamed of rowing a boat or of being rowed in one, you can expect to make steady progress along your chosen path."}, {"dreamName": "Ruins", "dreamText": "Ancient ruins are a lucky omen of improving conditions, but a contemporary ruin is a forecast of unhappy news concerning a close friend or relative."}, {"dreamName": "Run", "dreamText": "Running suggests that you are involved in a situation (or obligation) from which you would like to escape; talk it over with a competent adviser of friend before the resentment has serious repercussions. Being unable to run indicates a lack of self-confidence. Try asserting yourself now and then and you might be surprised at the results."}], "S": [{"dreamName": "Sadness", "dreamText": "Whatever your worries or troubles may be, they will soon be over."}, {"dreamName": "Sale", "dreamText": "An increase in material possessions through a legacy or valuable gift is forecast in a dream of going to a sale; the sale of personal belongings predicts an approaching increase in income."}, {"dreamName": "Salt", "dreamText": "In all respects an excellent omen, for even if you spilled the salt, all difficulty will be short in duration."}, {"dreamName": "Sanitarium", "dreamText": "Being a patient in a sanitarium is a sign that you should take better care of your health, but a dream of visiting someone else there suggests you are worrying needlessly. In either case, a medical checkup is likely to prove beneficial."}, {"dreamName": "Sand", "dreamText": "Whether the sand was on a beach, in your food, or in your shoes, it is warning you to be wary of new acquaintance who will try to exploit you."}, {"dreamName": "Scale", "dreamText": "Scales are a symbol of important decisions to be made; to scale a fish is a sign that you will uncover a false friend."}, {"dreamName": "Scissors", "dreamText": "Scissors are thought to portend a broken relationship, but to use scissors signifies that you can outwit a jealous competitor with prompt action."}, {"dreamName": "Screams", "dreamText": "To hear the screams of others signifies that you are likely to hear distressing news; however, screaming yourself is considered a fortunate omen."}, {"dreamName": "Séance", "dreamText": "A warning not to let foolish pride stand in the way of accepting needed help."}, {"dreamName": "Shadow", "dreamText": "Most authorities seem to agree that to be aware of your own shadow is a sign of a beneficial legal matter like an inheritance or legacy. However, if the shadows were not your own, their meaning must be gleaned by correlating the other details of your dream. The shadow of a dead person is an indication of a temporary obstacle; the shadow of a living person is believed to be a warning against travel or unnecessary risks for a few week's time."}, {"dreamName": "Shark", "dreamText": "An omen of danger from dishonest friends or associates; be extra cautious in all financial matters for the time being."}, {"dreamName": "Shower", "dreamText": "An omen of coming prosperity."}, {"dreamName": "Shy", "dreamText": "If it's your own shyness, it is a forecast of success in your current undertakings, but the shyness of others means you are likely to be thwarted in by the sudden backing out of someone you rely on."}, {"dreamName": "Skeleton", "dreamText": "A skeleton predicts news of a legacy, unless it was seen as part of a medical display or in a museum, in which case it augurs new and interesting friends and events."}, {"dreamName": "Slip", "dreamText": "To dream of losing your footing on something slippery is a warning to be more selective about where you place your confidence."}, {"dreamName": "Snake(s).", "dreamText": "n its psychological interpretation, a snake in your dream is a phallic symbol, and to dream of one, especially if it was coiled around you or otherwise draped on your body, is a warning that you may be a slave to either your sexual passions or repressions. However, according to the oracles, snakes are warnings of various troubles, obstacles, or treachery. Of course the colors and other details must be carefully considered, but as a general rule,\nbeing bitten by one portends a period of struggle against unfortunate circumstances\nif it was a cobra it carries a special warning to guard against accidents in the next few weeks\nif the snake wound around you and you could not throw it off, you are being warned to expect treachery where you least suspect it\nbeing surrounded by and unable to kill more than one snake indicates that you are in danger of being seriously cheated by someone you trust, but if you managed to kill (or get rid of) them all, it is a sign that you will succeed in spite of any hostile opposition\nwalking over snakes without trying to kill them suggests that you will, in the end, actually turn the tables on those who are trying to block your way\nplayfully handling snakes suggests that you are in danger of being led astray by unprincipled friends or associates\nif you encounter a professional snake charmer at work, it indicates that you will have to defend your reputation against malicious gossip.\n"}, {"dreamName": "Sneeze", "dreamText": "If you sneezed, it means that nothing is likely to upset your applecart for some time to come, but if your dream concerned others sneezing, the indication is that you may have to do a bit of scheming or fighting to get what you want: Persevere."}, {"dreamName": "Sour", "dreamText": "Eating something sour suggests that you may be in danger of sacrificing personal happiness for material success: reassess your values."}, {"dreamName": "Spear", "dreamText": "An exciting love life is usually the message in a dream of using a spear, especially if it was used to catch fish; however, if you're not eligible or susceptible, the dream suggests a clearing of obstacles in your path."}, {"dreamName": "Spiders", "dreamText": " are a sign of general good luck. To kill one signifies good news; if it was spinning, it augurs approaching money; if it was climbing a wall, the dream is a harbinger of success in all that concerns you most deeply."}, {"dreamName": "Stagger", "dreamText": "Staggering is a caution against the flattery of those who wish to exploit you; if your dream concerned others staggering, you can expect to be asked to help a friend who is in trouble."}, {"dreamName": "Starfish", "dreamText": "This is a dream symbol for an influential person, so you must interpret according to the action. For example, if you found one, it suggests you will encounter an important new friendship."}, {"dreamName": "Statues", "dreamText": "Seeing one coming to life indicates the reforging of a broken friendship and/or the sudden realization of an abandoned hope."}, {"dreamName": "Steal", "dreamText": "Theft is a warning to be extra cautious in money or investment matters for the next few months, unless you were caught, which signifies good luck."}, {"dreamName": "Straitjacket", "dreamText": "An obstacle dream pertaining to financial stress. Its meaning depends on the outcome of the dreamed action. If you succeeded in releasing yourself or were released by someone else, you are likely to get unexpected help out of your difficulties; otherwise, you must be prepared for a period of sharp economy."}, {"dreamName": "Stream", "dreamText": "This dream is thought to symbolize the general flow of life forces, so if in your dream the stream was clear and flowed smoothly, you can expect your life pattern to follow likewise. Otherwise, you are likely to encounter obstacles in ratio to the turgidity or roughness of the water."}, {"dreamName": "Street(s).", "dreamText": "Strange streets signify profitable new ventures or associations. Curving or crooked ones indicate travel and surprises. A very long street suggests that you will need much patience before you get what you want."}, {"dreamName": "Strip", "dreamText": "If your dream featured a striptease act of any kind, it suggests that you are contemplating some sort of indiscreet behavior; the price will be higher than you think possible, so avoid it."}, {"dreamName": "Suffocation", "dreamText": "A warning to see your doctor."}, {"dreamName": "Sundial", "dreamText": "Pleasant social times are in store for you, and if by chance you were able to tell the time by it, you are soon likely to realize your deepest wish."}, {"dreamName": "Sweep", "dreamText": "Whatever your troubles are, they will be swept away on a happy wave of money luck if your dream featured this menial task."}, {"dreamName": "Swing", "dreamText": "A suggestion that issues hanging in the balance can be made to swing in your favor if you exercise patience and caution. Don't push."}, {"dreamName": "Syringe.", "dreamText": " symbol of renewed sexual vigor or, alternatively, new energy and ideas which should give you pleasure and satisfaction."}], "T": [{"dreamName": "Tail", "dreamText": "The tails of domestic animals indicate domestic happiness. Wild animal tails suggest profit after adversity, and fish tails signify successful speculation."}, {"dreamName": "Tarantula", "dreamText": "This venomous creature is a strong warning to guard your health, and if it bit you, a medical checkup would be advisable."}, {"dreamName": "Teacher", "dreamText": "A dream of being a teacher is telling by you that, if you want to avoid unpleasant repercussions, you must control your tendency to “hunt with the hounds and run with the hare.” Otherwise see Learn."}, {"dreamName": "Teeth", "dreamText": "One must, of course, correlate the action and other details of the dream, but as a general guide:\nfalse teeth signify unexpected help out of a difficult situation\nbroken or unusually worn down teeth are a sign of the deterioration of an important relationship\naching teeth portend family quarrels\nhaving teeth filled promises good news, and having teeth pulled forecasts favorable business or investment opportunities\nloose teeth are a warning of untrustworthy friends\nif they fell out or you spit them out, it is a sign of a season of financial reverses\ndecayed teeth mean health problems; see your doctor\neven and/or very white and beautiful teeth forecast happiness and prosperity\nvery long teeth predict legal action. If one tooth is longer than the others, it portends sad news\nbuckteeth augur unexpected travel\nbridgework is a suggestion that you should be more meticulous in meeting your obligations\na dream featuring the roots of your teeth is a warning against lending money or gambling\nhaving a nerve removed predicts a season of good luck\nbrushing your teeth indicates the clearance of obstacles which have been holding you back, unless one or more bristles get stuck between your teeth, in which case you will still overcome the obstacles but only after continued patient effort\npicking your teeth is a warning of false friends in your close circle.\n"}, {"dreamName": "Telegram", "dreamText": "If the message was pleasant, the dream augurs money luck; otherwise, it is a sign that you must curb your extravagance or suffer difficulties as a consequence."}, {"dreamName": "Telephone", "dreamText": "Using a telephone is a warning that you have rivalry where you least expect it. If your dream featured a telephone which was out of order, it portends sad news."}, {"dreamName": "Thirst", "dreamText": "An obstacle dream which suggests that you are an aggressive leader. The meaning depends on whether or not you quenched your thirst. If you did so at a well or a spring, your success will be beyond your highest expectations."}, {"dreamName": "Thorns", "dreamText": "To catch your clothes or body on a thorn is a warning that your reputation is being jeopardized by unsavory companions. A little tactful disentanglement seems to be in order."}, {"dreamName": "Threat", "dreamText": "You are being strongly warned against gambling or speculation if your dream featured any form of threat or threatening atmosphere."}, {"dreamName": "Tickle", "dreamText": "Whether you dreamed of being tickled or of tickling someone else, it's warning you against indiscreet relations with the opposite sex. This may be on either the romantic level or simply in the area of giving confidences."}, {"dreamName": "Toilet", "dreamText": "Going to the toilet yourself is a sign of litigation over money or property; if someone else was, you are likely to be surprised by a request for a loan."}, {"dreamName": "Tombs", "dreamText": "Fortunate influences are working in your favor, unless you dreamed of being locked in one, in which case a medical checkup would be advisable."}, {"dreamName": "Traps", "dreamText": "It is a fortunate sign for a man to dream of setting traps, but for a woman it signifies that she has misplaced her trust. Being caught in a trap is a warning to steer clear of gossip and/or intrigue."}, {"dreamName": "Trapdoor", "dreamText": "An outstanding revelation is likely to follow. Don't get panicked into a hasty decision you may later regret. Play it cool."}, {"dreamName": "Treasure", "dreamText": "Early prosperity is predicted. Digging for it is an augury of improving health, and diving for it forecasts a valuable gift or unexpected legacy."}, {"dreamName": "Trial", "dreamText": "Being on trial is a warning to be cautious in developing new ties and/or entering into new ventures. Stick to known paths for the time being."}, {"dreamName": "Tumors", "dreamText": "New and interesting responsibilities are coming your way."}, {"dreamName": "Tunnel", "dreamText": "An obstacle dream if you were struggling to get through it, in which case the meaning depends on the outcome of the action. Otherwise, it represents a change, risk, or opportunity which is causing you some mental conflict; talk it over with a trusted friend or adviser before you commit yourself."}, {"dreamName": "Turtles", "dreamText": "These creatures are a symbol of frustrated ambition due to hidden hostility. If you persevere, you may dispel the opposition; however, if after a reasonable time the obstacle remains, you should reassess the position with an eye to altering your aim or your approach to it."}], "U": [{"dreamName": "Ugliness", "dreamText": "It is a lucky omen to dream of an ugly person; however, if you dreamed of being ugly yourself, it suggests that you must try to cultivate a more outgoing personality if you want to hold on to valued friends."}, {"dreamName": "Unfaithful", "dreamText": "You will soon have a demonstration of sincerity and/or devotion. However, if you dreamed of being unfaithful, it signifies that you are, or will shortly be, confronted by an unusual temptation to stray off the lines. Meditate but don't vacillate or you might fall between two stools."}, {"dreamName": "Unicorn", "dreamText": "This mythical creature is telling you that you are in for a period of beneficial changes."}], "V": [{"dreamName": "Vacation", "dreamText": "A paid vacation signifies and increase in income, but if the dreamed vacation was at your own expense, it predicts an unexpected gain or valuable gift."}, {"dreamName": "Vampire", "dreamText": "A vampire is a symbol of anxiety and sharp emotional conflict. It is likely that this dream relates to some ambition which you subconsciously feel is immoral or unethical. Talk it over with a competent friend or adviser."}, {"dreamName": "Vault", "dreamText": "A money vault is a caution against putting on a front which could damage your hopes instead of advancing them."}, {"dreamName": "Vermin", "dreamText": "Vermin pertain to current projects and hopes and foretell setbacks and disappointments, unless you killed them or otherwise got rid of them, in which case the dream predicts unqualified success."}, {"dreamName": "Vertigo", "dreamText": "An attack of vertigo is a warning against being exploited by the opposite sex."}, {"dreamName": "Volcano", "dreamText": "An erupting volcano signifies that you have been ignoring a potentially dangerous situation which you will have to adjust; the sooner you do it, the easier it will be— stop drifting. A smoking volcano is a sign of a passionate love affair based on deceit; break the habit before it breaks you. An inactive volcano is a warning against new ventures; don't make any important changes for a few months."}, {"dreamName": "Voodoo", "dreamText": "You are in danger of being led astray by undesirable associates; if you are not capable of resisting the pressure alone, don't be too proud to ask for help."}], "W": [{"dreamName": "Wasps", "dreamText": "These creatures signify it is time to break off an unrewarding relationship which is retarding your progress."}, {"dreamName": "Water", "dreamText": "The meaning of course, depends on the details and the action, but as a general guide, clear calm water is a favourable omen, while rough or murky water signifies difficulties. A dream of drinking cold water is a sign of good luck, but throwing or spilling it on anyone indicates a need to control your temper. Hot water (unless it is appropriate to the action) portends a season of social and/or business setbacks, but running water predicts lasting happiness. A waterfall in your dream forecasts a happy rise in status and/or an imminent increase in material wealth. Gently flowing water promises contentment and peace of mind."}, {"dreamName": "Wealth", "dreamText": "To dream of the wealth of others indicates that you have no need to doubt the sincerity of your friends; but possessing great wealth yourself portends financial reverses which will in some manner have long range benefits."}, {"dreamName": "Wedding.", "dreamText": "Although there is considerable variation among the oracles in regard to the meaning of this dream, a consensus seem to agree that it is a symbol of a Happy but brief interlude. Of course all the details must be correlated and the interpretation thereby modified."}, {"dreamName": "Well. ", "dreamText": "well with a high water level signifies abundance; a low water level indicates a period of difficulties; to draw water from a clear well predicts happiness, from a muddy well disappointment in love; an overflowing well is a warning to be careful in giving confidences, a dry well portends frustration; discovery of a well indicates approaching wealth, but digging a well prophesies hard work for small rewards. A public well predicts the uncovering of secrets; water rising in a well is a sign your love affairs will flourish, and if you climbed into a well, you are likely to take an unexpected trip; to fall into a well predicts news of an illness, but to drink from one promises joy and success. Other than the foregoing the dream must be interpreted by relating the action to the condition of the water and other details."}, {"dreamName": "Whale", "dreamText": "This big creature is a splendid dream omen signifying protective influences around you, and if you saw the flukes of its tail, freedom from worry will soon be yours."}, {"dreamName": "Whip", "dreamText": "A dream featuring the whipping of an animal suggests you have some injustice on your conscience; either make amends or try to forget it."}, {"dreamName": "Whispers", "dreamText": "Whispering voices heard in your dreams are a warning to control hasty outbursts if you want to avoid unpleasant repercussions; count at least to ten before you speak. It’s better to repress than to reopen."}, {"dreamName": "Whistle", "dreamText": "If you whistled in your dream, you are likely to have to cope with some unjust criticism; if you heard others whistling you can expect to have to revise or delay a current project."}, {"dreamName": "Will", "dreamText": "Making your own will signifies that your health worries are unfounded; if it's someone else's will, unexpected family problems will soon come to your attention."}, {"dreamName": "Wind", "dreamText": "If you felt a brisk steady breeze in your dream, it is a good omen for all your current concerns; but if it came in intermittent gusts, it portends some periods of frustration and delay to be overcome. A gentle wind predicts approaching good news; a stormy gale forecasts hard work ahead; and to dream of being buffeted by a strong wind indicates that you will have to fight some tough and probably tricky competition to get what you want."}, {"dreamName": "Wine", "dreamText": "Health, happiness, and prosperity are predicted in a dream featuring wine, unless it was being drunk from the bottle, in which case it is a warning that you should take extra precautions to avoid revealing a secret - or having one revealed."}, {"dreamName": "Witch", "dreamText": "These haggy characters in your dream indicate happy social times ahead, but if you're involved in a love affair, they are a symbol of disenchantment."}, {"dreamName": "Wizard", "dreamText": "Hidden forces are working for you."}, {"dreamName": "Wolf", "dreamText": "This animal is, as expected, a symbol of hard times or financial embarrassment, so pull in your belt... unless you managed, in your dream, to kill it or drive it way, in which case it predicts success in spite of all obstacles."}, {"dreamName": "Wrinkles", "dreamText": "Facial or skin wrinkles signify a gratifying increase in social popularity."}], "X": [{"dreamName": "X Rays", "dreamText": "These signify good health and release from worry. If you were looking at your own X-rays, you can expect to have an answer to some past indiscretion."}], "Y": [{"dreamName": "Yacht", "dreamText": "A yacht in your dream is a symbol of financial improvement, and if you were being entertained on it, you are sure to realize your highest hopes. To dream of being on a yacht in a choppy sea predicts a sudden stroke of money luck."}], "Z": [{"dreamName": "Zebra", "dreamText": "A herd of these striped animals is a warning that your efforts are being expended in the wrong direction; however, if your dream featured a tame one, it predicts gain from an unexpected source."}, {"dreamName": "Zoo", "dreamText": "You'll be seeing new faces in far-off places. If you took a child (or children) along, your travels will be profitable as well as pleasurable."}]}